Project/Toir/src/Reports/торо_НаработкаОборудованияСПоследнихРемонтов/торо_НаработкаОборудованияСПоследнихРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_НаработкаОборудованияСПоследнихРемонтов</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>ОсновнаяИерархия</name>
      <description>Основная иерархия</description>
    </items>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныеЭлементыВДереве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>14</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КомментарийМатрицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеСредство</name>
    <comment>TOIR20-222</comment>
    <type>
      <types>CatalogRef.гкс_ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_МетодПланированияТоир</name>
    <type>
      <types>EnumRef.гкс_МетодыПланированияТоир</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ВыборИзМатрицы</name>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ВидыРемонтов/торо_ВидыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыРемонтов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОбслуживанияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланГрафикППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикМероприятий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непериодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ТипРабот</name>
    <type>
      <types>EnumRef.гкс_ТипыРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_НаработкаОборудованияСПоследнихРемонтов/ObjectModule.bsl
Перем ОбъектРемонта Экспорт;  // Ссылка на объект ремонта, параметр отчета.
Перем СтруктураИерархии Экспорт; // Структура иерархии, параметр отчета.
Перем ВместеСПодчиненными Экспорт; // Флаг, параметр отчета.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ВыбратьЗначенияНастроек(ПользовательскиеНастройкиЭлементы, Форма);
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ВыбратьЗначенияНастроек(ПользовательскиеНастройкиЭлементы, Форма);
КонецПроцедуры

Процедура ВыбратьЗначенияНастроек(ПользовательскиеНастройкиЭлементы, Форма)
	
	ПараметрыВыполнения = Форма.Параметры;
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(Элемент.Параметр) = "ОбъектРемонта" Тогда
				Если ПараметрыВыполнения.Свойство("ОбъектРемонта") Тогда
					Элемент.Значение      = ПараметрыВыполнения.ОбъектРемонта;
					Элемент.Использование = Истина;			
					Продолжить;
				КонецЕсли;
			ИначеЕсли Строка(Элемент.Параметр) = "СтруктураИерархии" Тогда
				Если ПараметрыВыполнения.Свойство("СтруктураИерархии") Тогда
					Элемент.Значение      = ПараметрыВыполнения.СтруктураИерархии;
					Элемент.Использование = Истина;			
					Продолжить;
				КонецЕсли;
			ИначеЕсли Строка(Элемент.Параметр) = "ВместеСПодчиненными" Тогда
				Если ПараметрыВыполнения.Свойство("ВместеСПодчиненными") Тогда
					Элемент.Значение      = ПараметрыВыполнения.ВместеСПодчиненными;
					Элемент.Использование = Истина;			
					Продолжить;
				КонецЕсли;			
			ИначеЕсли Строка(Элемент.Параметр) = "Период" Тогда
				Если ПараметрыВыполнения.Свойство("ДатаКон") и ПараметрыВыполнения.Свойство("ДатаНач") Тогда
					Элемент.Значение      = Новый СтандартныйПериод(ПараметрыВыполнения.ДатаНач, ПараметрыВыполнения.ДатаКон);
					Элемент.Использование = Истина;			
					Продолжить;
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтруктураИерархии")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ТекущаяДата");

	Если ТекИерархия.СтроитсяАвтоматически Тогда
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
	Иначе
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);
	КонецЕсли;
	
	// Сгенерируем макет компоновки данных при помощи компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ТабНаработки = ПолучитьТабЗначСРезультатомОтчета();
	ТабРезультата = ДобавитьКолонкуОбъектИерархии(ТабНаработки, ТекИерархия);
	
	ФОВыделятьИнвестиционныеРемонты = ПолучитьФункциональнуюОпцию("торо_ВыделятьИнвестиционныеРемонты");
	Для Каждого ЭлементВыбора Из Настройки.Выбор.Элементы Цикл
		Если ЭлементВыбора.Заголовок = "Последний капитальный ремонт" Тогда
			ЭлементВыбора.Использование = ФОВыделятьИнвестиционныеРемонты;
		КонецЕсли;
	КонецЦикла;
		
	// В качестве схемы компоновки будет выступать схема самого отчета.
	// В качестве настроек отчета - текущие настройки отчета.
	// Данные расшифровки будем помещать в свойство расширения формы - ДанныеРасшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// получаем внешние наборы данных
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("НаборДанных", ТабРезультата);
	
	// Создадим и инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки,Истина);
	
	// Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;

	// выводим отчет
	ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТабЗначСРезультатомОтчета()
	
	ИдПериод = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту 
		(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра 
		(Новый ПараметрКомпоновкиДанных("Период")));
	ИдОбъектРемонта = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту 
		(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра 
		(Новый ПараметрКомпоновкиДанных("ОбъектРемонта")));
	ИдСтруктураИерархии = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту 
		(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра 
		(Новый ПараметрКомпоновкиДанных("СтруктураИерархии")));
	ИдВместеСПодчиненными = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту 
		(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра 
		(Новый ПараметрКомпоновкиДанных("ВместеСПодчиненными")));
	
	Период = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдПериод);
	ДатаНач = Период.Значение.ДатаНачала;
	ДатаКон = Период.Значение.ДатаОкончания;

	ОбъектРемонта = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдОбъектРемонта).Значение;
	СтруктураИерархии = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдСтруктураИерархии).Значение;
	ВместеСПодчиненными = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдВместеСПодчиненными).Значение;
	
	Если ВместеСПодчиненными Тогда
		МассивОР = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ОбъектРемонта, СтруктураИерархии);
		МассивОР.Добавить(ОбъектРемонта);
	Иначе
		Если ОбъектРемонта <> Неопределено Тогда
			МассивОР = Новый Массив;
			МассивОР.Добавить(ОбъектРемонта);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	МенВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ОбъектРемонта,
	               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот,
	               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID,
	               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ДатаОкончания
	               |ПОМЕСТИТЬ ПоследниеРемонтыВСЕ
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(&ДатаКон, " + ?(МассивОР = Неопределено, "", "ОбъектРемонта В (&МассивОР) ") + ") КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	               |;
	               |
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПоследниеРемонтыВСЕ.ОбъектРемонта,
	               |	ПоследниеРемонтыВСЕ.ВидРемонтныхРабот,
	               |	ПоследниеРемонтыВСЕ.ID,
	               |	ПоследниеРемонтыВСЕ.ДатаОкончания
	               |ПОМЕСТИТЬ ПоследниеРемонтыРазрешенныеОР
	               |ИЗ
	               |	ПоследниеРемонтыВСЕ КАК ПоследниеРемонтыВСЕ
						|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
						|	ПО ПоследниеРемонтыВСЕ.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	               |;
						|
						|////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследниеРемонты.ОбъектРемонта,
	               |	МАКСИМУМ(ПоследниеРемонты.ДатаОкончания) КАК ДатаОкончания
	               |ПОМЕСТИТЬ ТабМаксДат
	               |ИЗ
	               |	ПоследниеРемонтыРазрешенныеОР КАК ПоследниеРемонты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследниеРемонты.ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследниеРемонты.ОбъектРемонта,
	               |	ПоследниеРемонты.ВидРемонтныхРабот КАК ВидРемонта,
	               |	ПоследниеРемонты.ID КАК ID_Ремонта,
	               |	ПоследниеРемонты.ДатаОкончания КАК ДатаНачала
	               |ПОМЕСТИТЬ Капитальные
	               |ИЗ
	               |	ПоследниеРемонтыРазрешенныеОР КАК ПоследниеРемонты
	               |ГДЕ
	               |	ПоследниеРемонты.ВидРемонтныхРабот В
	               |			(ВЫБРАТЬ
	               |				торо_ВидыРемонтов.Ссылка
	               |			ИЗ
	               |				Справочник.торо_ВидыРемонтов КАК торо_ВидыРемонтов
	               |			ГДЕ
	               |				торо_ВидыРемонтов.КапитальныйРемонт)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследниеРемонты.ОбъектРемонта,
	               |	ПоследниеРемонты.ВидРемонтныхРабот,
	               |	ПоследниеРемонты.ID,
	               |	ПоследниеРемонты.ДатаОкончания
	               |ПОМЕСТИТЬ НеКапитальные
	               |ИЗ
	               |	ТабМаксДат КАК ТабМаксДат
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеРемонтыРазрешенныеОР КАК ПоследниеРемонты
	               |		ПО ТабМаксДат.ОбъектРемонта = ПоследниеРемонты.ОбъектРемонта
	               |			И ТабМаксДат.ДатаОкончания = ПоследниеРемонты.ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Капитальные.ОбъектРемонта, НеКапитальные.ОбъектРемонта) КАК ОбъектРемонта,
	               |	Капитальные.ВидРемонта КАК ВидРемонтаКапитальный,
	               |	НеКапитальные.ВидРемонтныхРабот,
	               |	Капитальные.ДатаНачала КАК ДатаРемонтаКапитальный,
	               |	НеКапитальные.ДатаОкончания КАК ДатаРемонта,
	               |	Капитальные.ID_Ремонта КАК IDКапитального,
	               |	НеКапитальные.ID
	               |ПОМЕСТИТЬ Результат
	               |ИЗ
	               |	Капитальные КАК Капитальные
	               |		ПОЛНОЕ СОЕДИНЕНИЕ НеКапитальные КАК НеКапитальные
	               |		ПО Капитальные.ОбъектРемонта = НеКапитальные.ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Капитальные.ОбъектРемонта,
	               |	Капитальные.ВидРемонта,
	               |	Капитальные.ID_Ремонта,
	               |	Капитальные.ДатаНачала
	               |ИЗ
	               |	Капитальные КАК Капитальные
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	НеКапитальные.ОбъектРемонта,
	               |	НеКапитальные.ВидРемонтныхРабот,
	               |	НеКапитальные.ID,
	               |	НеКапитальные.ДатаОкончания
	               |ИЗ
	               |	НеКапитальные КАК НеКапитальные";
						   
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",ДатаКон);
	Если МассивОР <> Неопределено Тогда
		Запрос.УстановитьПараметр("МассивОР", МассивОР);
	КонецЕсли;
	
	ТабРемонтов = Запрос.Выполнить().Выгрузить();
	
	ТабНаработки = торо_РаботаСНаработкой.РассчитатьНаработкуСРемонта(ТабРемонтов, ДатаНач, ДатаКон);
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабНаработки.ДатаНач,
		|	ТабНаработки.ОбъектРемонтныхРабот,
		|	ТабНаработки.ВидРемонтныхРабот,
		|	ТабНаработки.ID,
		|	ТабНаработки.Наработка,
		|	ТабНаработки.Показатель
		|ПОМЕСТИТЬ ТабНаработки
		|ИЗ
		|	&ТабНаработки КАК ТабНаработки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Результат.ДатаРемонта КАК ДатаКон,
		|	Результат.ДатаРемонтаКапитальный КАК ДатаКонКапитальный,
		|	Результат.ОбъектРемонта КАК ОбъектРемонтныхРабот,
		|	Результат.ВидРемонтныхРабот,
		|	Результат.ВидРемонтаКапитальный,
		|	Результат.IDКапитального,
		|
		|	ТабНаработки.Наработка КАК Наработка,
		|	ТабНаработки.Показатель КАК Показатель
		|ПОМЕСТИТЬ ТабСНаработкой
		|ИЗ
		|	Результат КАК Результат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабНаработки КАК ТабНаработки
		|		ПО Результат.ID = ТабНаработки.ID
		|
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСНаработкой.ДатаКон,
		|	ТабСНаработкой.ДатаКонКапитальный,
		|	ТабСНаработкой.ОбъектРемонтныхРабот,
		|	ТабСНаработкой.ВидРемонтныхРабот,
		|	ТабСНаработкой.ВидРемонтаКапитальный,
		|	ТабСНаработкой.Наработка,
		|	ТабСНаработкой.Показатель,
		|	ТабНаработки.Наработка КАК НаработкаКапитальный,
		|	ТабНаработки.Показатель КАК ПоказательКапитальный
		|ИЗ
		|	ТабСНаработкой КАК ТабСНаработкой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабНаработки КАК ТабНаработки
		|		ПО ТабСНаработкой.IDКапитального = ТабНаработки.ID
		|		И ТабСНаработкой.Показатель = ТабНаработки.Показатель";
		
	Запрос.УстановитьПараметр("ТабНаработки", ТабНаработки);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНач);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаКон);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ДобавитьКолонкуОбъектИерархии(ТабНаработки, ТекИерархия)

	Запрос = Новый Запрос;
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_Данные.ДатаКон,
		|	ВТ_Данные.ДатаКонКапитальный,
		|	ВТ_Данные.ОбъектРемонтныхРабот,
		|	ВТ_Данные.ВидРемонтныхРабот,
		|	ВТ_Данные.ВидРемонтаКапитальный,
		|	ВТ_Данные.Наработка,
		|	ВТ_Данные.Показатель,
		|	ВТ_Данные.НаработкаКапитальный,
		|	ВТ_Данные.ПоказательКапитальный
		|ПОМЕСТИТЬ ВТ_ДанныеПредв
		|ИЗ
		|	&ВТ_Данные КАК ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПредв.ДатаКон,
		|	ВТ_ДанныеПредв.ДатаКонКапитальный,
		|	ВТ_ДанныеПредв.ОбъектРемонтныхРабот,
		|	ВТ_ДанныеПредв.ВидРемонтныхРабот,
		|	ВТ_ДанныеПредв.ВидРемонтаКапитальный,
		|	ВТ_ДанныеПредв.Наработка,
		|	ВТ_ДанныеПредв.Показатель,
		|	ВТ_ДанныеПредв.НаработкаКапитальный,
		|	ВТ_ДанныеПредв.ПоказательКапитальный,
		|	ВЫРАЗИТЬ(ВТ_ДанныеПредв.ОбъектРемонтныхРабот КАК Справочник.торо_ОбъектыРемонта)." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_ДанныеПредв КАК ВТ_ДанныеПредв";
		
	Иначе

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_Данные.ДатаКон,
		|	ВТ_Данные.ДатаКонКапитальный,
		|	ВТ_Данные.ОбъектРемонтныхРабот,
		|	ВТ_Данные.ВидРемонтныхРабот,
		|	ВТ_Данные.ВидРемонтаКапитальный,
		|	ВТ_Данные.Наработка,
		|	ВТ_Данные.Показатель,
		|	ВТ_Данные.НаработкаКапитальный,
		|	ВТ_Данные.ПоказательКапитальный
		|ПОМЕСТИТЬ ВТ_ДанныеПредв
		|ИЗ
		|	&ВТ_Данные КАК ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПредв.ДатаКон,
		|	ВТ_ДанныеПредв.ДатаКонКапитальный,
		|	ВТ_ДанныеПредв.ОбъектРемонтныхРабот,
		|	ВТ_ДанныеПредв.ВидРемонтныхРабот,
		|	ВТ_ДанныеПредв.ВидРемонтаКапитальный,
		|	ВТ_ДанныеПредв.Наработка,
		|	ВТ_ДанныеПредв.Показатель,
		|	ВТ_ДанныеПредв.НаработкаКапитальный,
		|	ВТ_ДанныеПредв.ПоказательКапитальный,
		|	ВТ_ДанныеПредв.ОбъектРемонтныхРабот КАК ОбъектИерархии
		|ИЗ
		|	ВТ_ДанныеПредв КАК ВТ_ДанныеПредв";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВТ_Данные", ТабНаработки);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДанные(ИмяПоиска, МестоПоиска)
	
	Для каждого Элемент Из МестоПоиска Цикл
		Если Элемент.Имя = ИмяПоиска Тогда
			
			Возврат Элемент;
			
		Иначе
			
			Результат = НайтиДанные(ИмяПоиска, Элемент.Структура);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
